In [22]:
pip install scikit-learn

Requirement already satisfied: scikit-learn in c:\users\user pc\appdata\local\programs\python\python313\lib\site-packages (1.7.2)
Requirement already satisfied: numpy>=1.22.0 in c:\users\user pc\appdata\local\programs\python\python313\lib\site-packages (from scikit-learn) (2.3.4)
Requirement already satisfied: scipy>=1.8.0 in c:\users\user pc\appdata\local\programs\python\python313\lib\site-packages (from scikit-learn) (1.16.3)
Requirement already satisfied: joblib>=1.2.0 in c:\users\user pc\appdata\local\programs\python\python313\lib\site-packages (from scikit-learn) (1.5.2)
Requirement already satisfied: threadpoolctl>=3.1.0 in c:\users\user pc\appdata\local\programs\python\python313\lib\site-packages (from scikit-learn) (3.6.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.2 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [16]:
import pandas as pd
import numpy as np

In [18]:
from sklearn.impute import SimpleImputer

In [38]:
# Create sample data
data = {
    'student_id': [1, 2, 3, 4, 5, 6, 7, 8],
    'name': ['Ali', 'Sara', 'Hassan', 'Mona', 'Khalid', 'Fatma', 'Omar', 'Layla'],
    'age': [22, np.nan, 24, 23, np.nan, 25, 21, np.nan],
    'python_marks': [85, 90, 78, 92, 88, 95, 80, 87],
    'excel_marks': [75, 82, 70, 89, 85, 90, 72, 88],
    'location': ['Muscat', 'Sohar', 'Nizwa', 'Salalah', 'Muscat', 'Sohar', 'Nizwa', 'Muscat']
}

In [50]:
# Create DataFrame
df = pd.DataFrame(data)
print(df)

   student_id    name   age  python_marks  excel_marks location
0           1     Ali  22.0            85           75   Muscat
1           2    Sara   NaN            90           82    Sohar
2           3  Hassan  24.0            78           70    Nizwa
3           4    Mona  23.0            92           89  Salalah
4           5  Khalid   NaN            88           85   Muscat
5           6   Fatma  25.0            95           90    Sohar
6           7    Omar  21.0            80           72    Nizwa
7           8   Layla   NaN            87           88   Muscat

In [43]:
imputer = SimpleImputer(strategy='mean')

In [44]:
df['column_with_missing'] = imputer.fit_transform(df[['age']]).ravel()
df

,student_id,name,age,python_marks,excel_marks,location,column_with_missing
0,1,Ali,22.0,85,75,Muscat,22.0
1,2,Sara,NaN,90,82,Sohar,23.0
2,3,Hassan,24.0,78,70,Nizwa,24.0
3,4,Mona,23.0,92,89,Salalah,23.0
4,5,Khalid,NaN,88,85,Muscat,23.0
5,6,Fatma,25.0,95,90,Sohar,25.0
6,7,Omar,21.0,80,72,Nizwa,21.0
7,8,Layla,NaN,87,88,Muscat,23.0

In [52]:
df.isna().sum()

student_id      0
name            0
age             3
python_marks    0
excel_marks     0
location        0
dtype: int64

In [53]:
df1 = pd.DataFrame(data)
print(df1)

   student_id    name   age  python_marks  excel_marks location
0           1     Ali  22.0            85           75   Muscat
1           2    Sara   NaN            90           82    Sohar
2           3  Hassan  24.0            78           70    Nizwa
3           4    Mona  23.0            92           89  Salalah
4           5  Khalid   NaN            88           85   Muscat
5           6   Fatma  25.0            95           90    Sohar
6           7    Omar  21.0            80           72    Nizwa
7           8   Layla   NaN            87           88   Muscat

In [67]:
#fill in with value
df1["age"].fillna(24) 
df

   student_id    name   age  python_marks  excel_marks location
0           1     Ali  22.0            85           75   Muscat
1           2    Sara  24.0            90           82    Sohar
2           3  Hassan  24.0            78           70    Nizwa
3           4    Mona  23.0            92           89  Salalah
4           5  Khalid  25.0            88           85   Muscat
5           6   Fatma  25.0            95           90    Sohar
6           7    Omar  21.0            80           72    Nizwa
7           8   Layla  21.0            87           88   Muscat

In [66]:
#backward fill
df1["age"] = df1["age"].bfill()
df1

   student_id    name   age  python_marks  excel_marks location
0           1     Ali  22.0            85           75   Muscat
1           2    Sara  24.0            90           82    Sohar
2           3  Hassan  24.0            78           70    Nizwa
3           4    Mona  23.0            92           89  Salalah
4           5  Khalid  25.0            88           85   Muscat
5           6   Fatma  25.0            95           90    Sohar
6           7    Omar  21.0            80           72    Nizwa
7           8   Layla  21.0            87           88   Muscat

In [65]:
#forward fill
df1["age"] = df1["age"].ffill()
df1

   student_id    name   age  python_marks  excel_marks location
0           1     Ali  22.0            85           75   Muscat
1           2    Sara  24.0            90           82    Sohar
2           3  Hassan  24.0            78           70    Nizwa
3           4    Mona  23.0            92           89  Salalah
4           5  Khalid  25.0            88           85   Muscat
5           6   Fatma  25.0            95           90    Sohar
6           7    Omar  21.0            80           72    Nizwa
7           8   Layla  21.0            87           88   Muscat